1) Create a dataset in the table.

In [3]:
import pandas as pd
data = {
    "Tid": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    "Refund": ["Yes", "No", "No", "Yes", "No", "No", "No", "No", "Yes", "No"],
    "Marital Status": ["Single", "Married", "Single", "Married", "Divorced", "Married", "Divorced", "Single", "Married", "Single"],
    "Taxable Income": ["125K", "100K", "70K", "120K", "95K", "60K", "220K", "85K", "75K", "90K"],
    "Cheat": ["No", "No", "No", "No", "Yes", "Yes", "No", "Yes", "Yes", "Yes"]
}
df = pd.DataFrame(data)
print(df)

   Tid Refund Marital Status Taxable Income Cheat
0    1    Yes         Single           125K    No
1    2     No        Married           100K    No
2    3     No         Single            70K    No
3    4    Yes        Married           120K    No
4    5     No       Divorced            95K   Yes
5    6     No        Married            60K   Yes
6    7     No       Divorced           220K    No
7    8     No         Single            85K   Yes
8    9    Yes        Married            75K   Yes
9   10     No         Single            90K   Yes

2) From the above table that you have created, locate row 0, 4, 7 and 8 using DataFrame.

In [6]:
selected_rows = df.loc[[0, 4, 7, 8]]
print(selected_rows)

   Tid Refund Marital Status Taxable Income Cheat
0    1    Yes         Single           125K    No
4    5     No       Divorced            95K   Yes
7    8     No         Single            85K   Yes
8    9    Yes        Married            75K   Yes

3) Navigate the DataFrame and do the following task for the table created in question 1:

Select row from index 3 to 7.

Select row from index 4 to 8, and column 2 to 4.

Select all rows with column index 1 to 3 (include index 3 during selection).

In [13]:
rows_3_to_7 = df.iloc[3:7]
print("Rows from index 3 to 7:")
print(rows_3_to_7)

Rows from index 3 to 7:
   Tid Refund Marital Status Taxable Income Cheat
3    4    Yes        Married           120K    No
4    5     No       Divorced            95K   Yes
5    6     No        Married            60K   Yes
6    7     No       Divorced           220K    No

In [15]:
rows = df.iloc[4:9, 2:5]
print("Rows from index 4 to 8, and columns 2 to 4:")
print(rows)

Rows from index 4 to 8, and columns 2 to 4:
  Marital Status Taxable Income Cheat
4       Divorced            95K   Yes
5        Married            60K   Yes
6       Divorced           220K    No
7         Single            85K   Yes
8        Married            75K   Yes

In [17]:
rows= df.iloc[:, 1:4]
print("All rows with column index 1 to 3:") 
print(rows)

All rows with column index 1 to 3:
  Refund Marital Status Taxable Income
0    Yes         Single           125K
1     No        Married           100K
2     No         Single            70K
3    Yes        Married           120K
4     No       Divorced            95K
5     No        Married            60K
6     No       Divorced           220K
7     No         Single            85K
8    Yes        Married            75K
9     No         Single            90K

4) Read a csv file and display its first five rows.

import pandas as pd
df = pd.read_csv('iris.csv')
print(df.head())

Q.5 From the csv file (uploaded in the Q.4) delete row 4, and delete column 3. Display the result.

import pandas as pd
df = pd.read_csv('iris.csv')
df = df.drop(index=4)
df = df.drop(df.columns[2], axis=1)
print(df)

Q.6 Create a Sample Dataset (employees.csv)

Dataset: Employee Information

Tasks to Perform on the Dataset

a) Determine the Shape of the DataFrame

(Find the number of rows and columns.)

b) Display a Summary of the DataFrame

(Include data types and non-null counts for each column.)

c) Generate Descriptive Statistics

(Provide statistical metrics like mean, median, minimum, maximum, etc., for numeric columns.)

d) Display Specific Rows

(Display the first 5 rows and the last 3 rows of the DataFrame.)

e) Calculate Specific Statistics

1. The average salary of employees.
2. The total bonus paid to all employees.
3. The youngest employee's age.
4. The highest performance rating.

f) Sort the DataFrame

(Sort the DataFrame by the Salary column in descending order.)

g) Add a New Column: Performance Category

Categorize employees based on their performance rating:
1. Excellent: Rating >= 4.5
2. Good: Rating >= 4.0 but < 4.5
3. Average: Rating < 4.0

h) Identify Missing Values

(Check for any missing values in the DataFrame.)

i) Rename a Column

(Rename the Employee_ID column to ID.)

j) Filter Employees

Find employees who meet the following conditions:
1. Have more than 5 years of experience.
2. Belong to the IT department.

k) Add a New Column: Tax

(Calculate 10% of the Salary for each employee and store it in a new column named Tax.)

l) Save the Modified DataFrame

(Save the modified DataFrame, including all new columns, to a new CSV file.)

In [64]:
import pandas as pd


data = {
    "Employee_ID": [101, 102, 103, 104, 105],
    "Name": ["Alice", "Bob", "Charlie", "Diana", "Edward"],
    "Department": ["HR", "IT", "IT", "Marketing", "Sales"],
    "Age": [29, 34, 41, 28, 38],
    "Salary": [50000, 70000, 65000, 55000, 60000],
    "Years_of_Experience": [4, 8, 10, 3, 12],
    "Joining_Date": ["2020-03-15", "2017-07-19", "2013-06-01", "2021-02-10", "2010-11-25"],
    "Gender": ["Female", "Male", "Male", "Female", "Male"],
    "Bonus": [5000, 7000, 6000, 4500, 5000],
    "Rating": [4.5, 4.0, 3.8, 4.7, 3.5]
}


df = pd.DataFrame(data)


print(df)

   Employee_ID     Name Department  Age  Salary  Years_of_Experience  \
0          101    Alice         HR   29   50000                    4
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining_Date  Gender  Bonus  Rating
0   2020-03-15  Female   5000     4.5
1   2017-07-19    Male   7000     4.0
2   2013-06-01    Male   6000     3.8
3   2021-02-10  Female   4500     4.7
4   2010-11-25    Male   5000     3.5

In [73]:
shape = df.shape
print("Shape of the DataFrame:", shape)
summary = df.info()
descriptive_stats = df.describe()
print("\nDescriptive Statistics:\n", descriptive_stats)
print("\nFirst 5 Rows:\n", df.head())
print("\nLast 3 Rows:\n", df.tail(3))
average_salary = df["Salary"].mean()
total_bonus = df["Bonus"].sum()
youngest_age = df["Age"].min()
highest_rating = df["Rating"].max()
print("\nAverage Salary:", average_salary)
print("Total Bonus:", total_bonus)
print("Youngest Employee's Age:", youngest_age)
print("Highest Performance Rating:", highest_rating)
sorted_df = df.sort_values(by="Salary", ascending=False)
print("\nDataFrame Sorted by Salary (Descending):\n", sorted_df)
def categorize_rating(rating):
    if rating >= 4.5:
        return "Excellent"
    elif 4.0 <= rating < 4.5:
        return "Good"
    else:
        return "Average"
df["Performance_Category"] = df["Rating"].apply(categorize_rating)
print("\nDataFrame with Performance Categories:\n", df)
missing_values = df.isnull().sum()
print("\nMissing Values in Each Column:\n", missing_values)
df.rename(columns={"Employee_ID": "ID"}, inplace=True)
print("\nDataFrame with Renamed Column:\n", df)

Shape of the DataFrame: (5, 10)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Employee_ID          5 non-null      int64
 1   Name                 5 non-null      object
 2   Department           5 non-null      object
 3   Age                  5 non-null      int64
 4   Salary               5 non-null      int64
 5   Years_of_Experience  5 non-null      int64
 6   Joining_Date         5 non-null      object
 7   Gender               5 non-null      object
 8   Bonus                5 non-null      int64
 9   Rating               5 non-null      float64
dtypes: float64(1), int64(5), object(4)
memory usage: 532.0+ bytes

Descriptive Statistics:
        Employee_ID        Age       Salary  Years_of_Experience   Bonus  \
count     5.000000   5.000000      5.00000             5.000000     5.0
mean    103.000000  34.000000  60000.00000             7.400000  5500.0
std       1.581139   5.612486   7905.69415             3.847077  1000.0
min     101.000000  28.000000  50000.00000             3.000000  4500.0
25%     102.000000  29.000000  55000.00000             4.000000  5000.0
50%     103.000000  34.000000  60000.00000             8.000000  5000.0
75%     104.000000  38.000000  65000.00000            10.000000  6000.0
max     105.000000  41.000000  70000.00000            12.000000  7000.0

         Rating
count  5.000000
mean   4.100000
std    0.494975
min    3.500000
25%    3.800000
50%    4.000000
75%    4.500000
max    4.700000

First 5 Rows:
    Employee_ID     Name Department  Age  Salary  Years_of_Experience  \
0          101    Alice         HR   29   50000                    4
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining_Date  Gender  Bonus  Rating
0   2020-03-15  Female   5000     4.5
1   2017-07-19    Male   7000     4.0
2   2013-06-01    Male   6000     3.8
3   2021-02-10  Female   4500     4.7
4   2010-11-25    Male   5000     3.5

Last 3 Rows:
    Employee_ID     Name Department  Age  Salary  Years_of_Experience  \
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining_Date  Gender  Bonus  Rating
2   2013-06-01    Male   6000     3.8
3   2021-02-10  Female   4500     4.7
4   2010-11-25    Male   5000     3.5

Average Salary: 60000.0
Total Bonus: 27500
Youngest Employee's Age: 28
Highest Performance Rating: 4.7

DataFrame Sorted by Salary (Descending):
    Employee_ID     Name Department  Age  Salary  Years_of_Experience  \
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
4          105   Edward      Sales   38   60000                   12
3          104    Diana  Marketing   28   55000                    3
0          101    Alice         HR   29   50000                    4

  Joining_Date  Gender  Bonus  Rating
1   2017-07-19    Male   7000     4.0
2   2013-06-01    Male   6000     3.8
4   2010-11-25    Male   5000     3.5
3   2021-02-10  Female   4500     4.7
0   2020-03-15  Female   5000     4.5

DataFrame with Performance Categories:
    Employee_ID     Name Department  Age  Salary  Years_of_Experience  \
0          101    Alice         HR   29   50000                    4
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining_Date  Gender  Bonus  Rating Performance_Category
0   2020-03-15  Female   5000     4.5            Excellent
1   2017-07-19    Male   7000     4.0                 Good
2   2013-06-01    Male   6000     3.8              Average
3   2021-02-10  Female   4500     4.7            Excellent
4   2010-11-25    Male   5000     3.5              Average

Missing Values in Each Column:
 Employee_ID             0
Name                    0
Department              0
Age                     0
Salary                  0
Years_of_Experience     0
Joining_Date            0
Gender                  0
Bonus                   0
Rating                  0
Performance_Category    0
dtype: int64

DataFrame with Renamed Column:
     ID     Name Department  Age  Salary  Years_of_Experience Joining_Date  \
0  101    Alice         HR   29   50000                    4   2020-03-15
1  102      Bob         IT   34   70000                    8   2017-07-19
2  103  Charlie         IT   41   65000                   10   2013-06-01
3  104    Diana  Marketing   28   55000                    3   2021-02-10
4  105   Edward      Sales   38   60000                   12   2010-11-25

   Gender  Bonus  Rating Performance_Category
0  Female   5000     4.5            Excellent
1    Male   7000     4.0                 Good
2    Male   6000     3.8              Average
3  Female   4500     4.7            Excellent
4    Male   5000     3.5              Average

In [75]:
filtered_employees = df[(df["Years_of_Experience"] > 5) & (df["Department"] == "IT")]
print("\nEmployees with > 5 Years of Experience in IT Department:\n", filtered_employees)
df["Tax"] = df["Salary"] * 0.1
print("\nDataFrame with Tax Column:\n", df)
df.to_csv("modified_employees.csv", index=False)
print("\nModified DataFrame saved to 'modified_employees.csv'")

Employees with > 5 Years of Experience in IT Department:
     ID     Name Department  Age  Salary  Years_of_Experience Joining_Date  \
1  102      Bob         IT   34   70000                    8   2017-07-19
2  103  Charlie         IT   41   65000                   10   2013-06-01

  Gender  Bonus  Rating Performance_Category
1   Male   7000     4.0                 Good
2   Male   6000     3.8              Average

DataFrame with Tax Column:
     ID     Name Department  Age  Salary  Years_of_Experience Joining_Date  \
0  101    Alice         HR   29   50000                    4   2020-03-15
1  102      Bob         IT   34   70000                    8   2017-07-19
2  103  Charlie         IT   41   65000                   10   2013-06-01
3  104    Diana  Marketing   28   55000                    3   2021-02-10
4  105   Edward      Sales   38   60000                   12   2010-11-25

   Gender  Bonus  Rating Performance_Category     Tax
0  Female   5000     4.5            Excellent  5000.0
1    Male   7000     4.0                 Good  7000.0
2    Male   6000     3.8              Average  6500.0
3  Female   4500     4.7            Excellent  5500.0
4    Male   5000     3.5              Average  6000.0

Modified DataFrame saved to 'modified_employees.csv'